Repository: 84000/data-translation-memory
Catalog: Toh_157-The_Questions_of_the_Kimnara_King_Druma-v2.tmx
Source language: bo
Languages: en

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བཟོད་པའི་རྒྱན་གྱིས་བརྒྱན་པ་རྣམས་ལགས།
en: How do bodhisattvas become adorned with the ornament of patience?

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་ཀྱི་རྒྱན་གྱིས་བརྒྱན་པ་རྣམས་ལགས།
en: How do bodhisattvas become adorned with the ornament of diligence?

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བསམ་གཏན་གྱི་རྒྱན་གྱིས་བརྒྱན་པ་རྣམས་ལགས།
en: How do bodhisattvas become adorned with the ornament of concentration?

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་རྒྱན་གྱིས་བརྒྱན་པ་རྣམས་ལགས།
en: How do bodhisattvas become adorned with the ornament of insight?

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཚངས་པའི་ལམ་ལ་མཁས་པ་རྣམས་ལགས།
en: How do bodhisattvas become experts in the path of purity?

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མངོན་པར་ཤེས་པ་ལས་མི་ཉམས་པ་རྣམས་ལགས།
en: How do the higher perceptions of bodhisattvas remain free of decline?

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་གཡུལ་ལས་རྣམ་པར་རྒྱལ་བ་རྣམས་ལགས།
en: How do bodhisattvas become victorious in battle?

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྒལ་ནས་ཕ་རོལ་ཐང་ལ་གནས་པ་རྣམས་ལགས།
en: How do bodhisattvas remain on the far shore after having crossed over?

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་ལམ་ཡང་སྟོན་ལ་མཚུངས་པར་སྤྱོད་པར་ཡང་རྣམ་པར་མི་རྟོག་པ་རྣམས་ལགས།
en: How do bodhisattvas display and imitate the conduct of hearers, solitary buddhas, and all beings while remaining without concepts?

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་འཁོར་བ་ལ་ཡང་ལྟ་ལ་མྱ་ངན་ལས་འདས་པ་ལ་ཡང་མི་གནས་པ་རྣམས་ལགས།
en: How do bodhisattvas set their sights on saṃsāra without remaining in nirvāṇa?

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཁམས་སྣ་ཚོགས་ལ་ཡང་རྣམ་པར་ལྟ་ལ་ཆོས་ཀྱི་དབྱིངས་ལས་ཀྱང་མི་གཡོ་བ་རྣམས་ལགས།
en: How do bodhisattvas consider various elements without parting from the realm of phenomena?

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དོན་ཡང་མི་འདོར་ལ་གནོད་པར་ཡང་ཀུན་དུ་གདའ་བ་རྣམས་ལགས།
en: How do bodhisattvas not give up being of benefit even when they appear to be engaging in harmful actions?

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བསོད་ནམས་ཀྱི་ནོར་དང་ལྡན་ལ་ཐབས་ཀྱིས་ནོར་མ་མཆིས་པ་རྣམས་ལགས།
en: How do bodhisattvas possess wealth due to merit and how are they without wealth due to skillful means?

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཨ་ཞེས་བགྱི་བའི་སྒོས་རྣམ་པ་མ་མཆིས་པའི་སྒོར་འཇུག་པ་རྣམས་ལགས།
en: How do bodhisattvas enter the gate without attributes through the gateway of the syllable a?

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་མངོན་སུམ་དུ་འགྱུར་བ་རྣམས་ལགས།
en: How do bodhisattvas actualize all buddha qualities?

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་རྣམ་པར་གདོན་མི་ཟ་བ་རྣམས་ལ་རྣམ་པར་ཕྱེ་བ་ཤིན་ཏུ་རྣམ་པར་འབྱེད་པ་རྣམས་ལགས།
en: How do bodhisattvas gain certainty about the Dharma and discern its distinctions?

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་འཇིག་རྟེན་གྱི་བྱ་བ་དང་འཐུན་པར་ཞུགས་ཀྱང་ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱིས་མི་གོས་པ་རྣམས་ལགས།
en: How do bodhisattvas act in accord with the world while remaining untainted by afflictions?

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་གཞན་དག་གིས་བལྟར་མི་མཐོང་བའི་ཆོས་ཀྱི་དབང་ཕྱུག་རྣམས་ལགས།
en: How do bodhisattvas come to possess the might of the Dharma that is invisible to others?

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པ་མཐོང་བ་དང་མི་འབྲལ་བ་རྣམས་ལགས།
en: How are bodhisattvas never without meeting the thus-gone ones?

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཤིན་ཏུ་དུལ་ཞིང་མི་འཁྲུགས་པའི་ཆོས་ཅན་རྣམས་ལགས།
en: How do bodhisattvas remain composed and undisturbed?

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་རྣམས་བླངས་པ་མ་མཆིས་པར་སློབ་དཔོན་རྣམས་ལགས།
en: How do bodhisattvas become teachers without grasping at the teachings?

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྟོན་པར་གྱུར་པ་རྣམས་ལགས།
en: How do bodhisattvas become the teachers of all beings?

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་རྗེས་སུ་བསྐོར་བ་རྣམས་ལགས།
en: How do bodhisattvas turn the Dharma wheel of all the buddhas?

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་དབང་བསྐུར་བ་ཐོབ་པ་རྣམས་ལགས།
en: How do bodhisattvas obtain consecration into all buddha qualities?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལྷའི་ཅོད་པན་ལ་ལེགས་སོ་ཞེས་བྱ་བ་གནང་སྟེ།
en: When the bodhisattva great being Divyamauli had asked those questions, the Blessed One expressed his approval to him:

source: རིགས་ཀྱི་བུ་ལེགས་སོ་ལེགས་སོ། །
en: “Excellent, noble son, excellent!

source: རིགས་ཀྱི་བུ་ཁྱོད་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་སྙིང་བརྩེ་བ་དང་། སྐྱེ་བོ་ཕལ་པོ་ཆེའི་དོན་དང་། ལྷ་དང་མི་རྣམས་ལ་ཕན་པ་དང་། བདེ་བའི་ཕྱིར་ཞུགས་པ་དང་། རིགས་ཀྱི་བུ་ཁྱོད་ད་ལྟར་གྱི་དང་། མ་འོངས་པའི་སེམས་ཅན་རྣམས་རྗེས་སུ་གཟུང་བ་དང་། ཐེག་པ་ཆེན་པོ་འདི་ཡུན་རིང་དུ་གནས་པར་བྱ་བའི་ཕྱིར། རིགས་ཀྱི་བུ་ཁྱོད་དེ་བཞིན་གཤེགས་པ་ལ་གང་དོན་འདི་ཡོངས་སུ་འདྲི་བར་སེམས་པ་ནི་ལེགས་སོ། །
en: You act for the benefit and happiness of many beings; out of love for the world, you intend to benefit a vast number of beings and to bring assistance and happiness to gods and humans. Noble son, you have asked these questions to the Thus-Gone One to ensure that this Great Vehicle endures for a long time, because you care for the sentient beings of the present and future. Your intention is excellent!

source: རིགས་ཀྱི་བུ་དེའི་ཕྱིར་ཤིན་ཏུ་ལེགས་པར་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དངངས་ཁྱོད་ལ་བཤད་དོ། །
en: Noble son, listen carefully and pay attention. I shall now explain this.”

source: བཅོམ་ལྡན་འདས་ལེགས་སོ་ཞེས་གསོལ་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལྷའི་ཅོད་པན་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The bodhisattva great being Divyamauli said, “Excellent!” and listened as the Blessed One had directed. The Blessed One then said:

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་སྤོབས་པ་སྣ་ཚོགས་ཀྱི་རྒྱན་དང་ལྡན་པ་རྣམས་ཡིན་ནོ། །
en: “Noble son, if bodhisattvas possess four qualities, they will be adorned with various types of eloquence.

source: བཞི་གང་ཞེ་ན།
en: What are those four?

source: སེམས་ཅན་ཐམས་ཅད་ལ་འོད་ཟེར་ཐོགས་པ་མེད་པ་རྣམས་རིན་པོ་ཆེ་དང་སྡུག་པའི་དངོས་པོ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་ཞིང་ཡིད་འགྱོད་པ་མེད་པ་རྣམས་ཡིན།
en: They are (1) illuminating all beings unimpededly and giving them all precious and pleasant goods without regrets,

source: ཆོས་སྨྲ་བ་གཞན་དག་གིས་བཤད་པ་མི་ཟློག་ཅིང་རྗེས་སུ་ཡི་རང་སྟེ་དགའ་བ་དང་། མགུ་བ་དང་། དང་བ་དང་མཆོག་ཏུ་དགའ་བ་ཐོབ་ནས་
en: (2) not opposing the words of other Dharma preachers but rejoicing in their teachings and giving them their approval with joy, delight, trust, and enthusiasm,

source: ལེགས་སོ་ཞེས་བྱ་བ་སྦྱིན་པ་དང་། ཆོས་མཉན་པའམ། ཆོས་བགྲོ་བའམ། དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་གྱི་ཕྱིར་རམ། མཚན་མོ་འདུག་པར་བསྐུལ་ན་མཆོག་ཏུ་དགའ་བ་དང་ལྡན་པ་དང་།
en: (3) being delighted when listening to the Dharma, discussing it, or when they are requested to assist with the stūpa of a blissful one or to stay the night there, and

source: བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་ལྷག་པའི་བསམ་པ་དང་། ཟང་ཟིང་མེད་པའི་སེམས་ཀྱི་ཆོས་ཀྱི་སྦྱིན་པ་སྦྱིན་ཏེ
en: (4) giving the gift of the Dharma with the motivation of the mind of awakening, free from concern for material things.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་འདི་བཞི་དང་ལྡན་ན་སྤོབས་པ་སྣ་ཚོགས་རྒྱན་དང་ལྡན་པ་རྣམས་ཡིན་ནོ། །
en: Noble son, if bodhisattvas possess those four qualities, they will be adorned with various types of eloquence.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་ཆོས་ཟབ་མོ་རྣམ་པར་གདོན་མི་ཟ་བ་ལ་འཇུག་པ་ཤེས་པ་ལ་མཁས་པ་རྣམས་ཡིན་ནོ། །
en: “Noble son, if bodhisattvas possess four qualities, they will be experts in the knowledge that is free of doubts with respect to the profound Dharma.

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་དང་རྗེས་སུ་འཐུན་པ་དང་། བདག་གི་རང་བཞིན་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་རང་བཞིན་རྟོགས་པ་དང་། འདུ་བྱེད་ཐམས་ཅད་གར་ཡང་མི་འགྲོ། གང་ནས་ཀྱང་མ་འོངས་པར་རབ་ཏུ་ཤེས་པ་དང་། ཆོས་ཐམས་ཅད་ནམ་མཁའི་ཕྱག་རྒྱས་བཏབ་པར་མོས་པ་སྟེ།
en: They are (1) being in accord with dependent origination, (2) realizing the nature of all beings as they realize their own nature, (3) understanding that all formations do not come from and do not go anywhere, and (4) being confident that all phenomena are marked by the seal of space.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་འདི་བཞི་དང་ལྡན་ན་ཆོས་ཟབ་མོ་རྣམ་པར་གདོན་མི་ཟ་བ་ལ་འཇུག་པ་ཤེས་པ་ལ་མཁས་པ་རྣམས་ཡིན་ནོ། །
en: Noble son, if bodhisattvas possess those four qualities, they will be experts in the knowledge that is free of doubts with respect to the profound Dharma.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ་ཤེས་པ་ལ་མཁས་པ་རྣམས་ཡིན་ནོ། །
en: “Noble son, if bodhisattvas possess four qualities, they will be experts in knowing which beings are of the highest faculties and which are not.

source: ཆོས་ཀྱི་དབྱིངས་ཀྱི་སྒོ་ཤིན་ཏུ་སྦྱངས་པ་དང་། སྒྲིབ་པ་མེད་པའི་སྒོ་མངོན་སུམ་དུ་གྱུར་པ་དང་། མངོན་པར་ཤེས་པས་རྣམ་པར་རྩེ་བ་ཤེས་པ་དང་། སེམས་ལས་སུ་རུང་ཞིང་ཏིང་ངེ་འཛིན་ཕུན་སུམ་ཚོགས་པ་སྟེ།
en: They are (1) being well trained in the gateway to the realm of phenomena, (2) having actualized the gateway to the absence of obscuration, (3) knowing how to sport in the higher perceptions, and (4) having pliable minds and perfect absorption.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་འདི་བཞི་དང་ལྡན་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་མཆོག་དང་། མཆོག་མ་ཡིན་པ་ཤེས་པ་ལ་མཁས་པ་རྣམས་ཡིན་ནོ། །
en: Noble son, if bodhisattvas possess those four qualities, they will be experts in knowing which beings are of the highest faculties and which are not.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་སོ་སོ་ཅི་རིགས་པར་ཆོས་སྟོན་པ་ལ་མཁས་པ་རྣམས་ཡིན་ནོ། །
en: “Noble son, if bodhisattvas possess four qualities, they will be experts in teaching the Dharma in accordance with each being individually.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་ཤེས་པ་དང་། སེམས་ཅན་གཟུད་པ་ཤེས་པ་དང་། ཆོས་རབ་ཏུ་རྣམ་པར་འབྱེད་པའི་ཤེས་པ་དང་། བདག་གིས་སེམས་སྦྱངས་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་སྦྱངས་པར་རབ་ཏུ་ཤེས་པ་སྟེ།
en: They are (1) knowing the four correct knowledges, (2) knowing how to guide beings, (3) knowing the distinctions of the Dharma, and (4) knowing how to train the minds of all beings by having trained their own minds.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་འདི་བཞི་དང་ལྡན་ན་སོ་སོ་ཅི་རིགས་པར་ཆོས་སྟོན་པ་ལ་མཁས་པ་རྣམས་ཡིན་ནོ། །
en: Noble son, if bodhisattvas possess those four qualities, they will be experts in teaching the Dharma in accordance with each being individually.

source: !རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་ཀྱི་བསམ་པ་མཉམ་ཞིང་སྤྱོད་པ་ཤེས་པ་ལ་འཇུག་པར་མཁས་པ་རྣམས་ཡིན་ནོ། །
en: “Noble son, if bodhisattvas possess four qualities, they will be experts in knowing the mental activity of all beings.

source: ཤེས་རབ་ཀྱི་འཛུད་པ་དང་། ཡེ་ཤེས་ཆགས་པ་མེད་པ་དང་། ཐབས་ཀྱིས་ཞུགས་པས་སྒྲིབ་པ་ཐམས་ཅད་རྒྱུན་བཅད་པ་དང་། བློ་ཤིན་ཏུ་སྦྱངས་པ་སྟེ།
en: They are (1) being guided by insight, (2) being endowed with wisdom free of attachment, (3) having eliminated all obscurations by applying methods, and (4) having thoroughly trained minds.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་འདི་བཞི་དང་ལྡན་ན་སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་ཀྱི་བསམ་པ་མཉམ་ཞིང་། སྤྱོད་པ་ཤེས་པ་ལ་འཇུག་པར་མཁས་པ་རྣམས་ཡིན་ནོ། །
en: Noble son, if bodhisattvas possess those four qualities, they will be experts in knowing the mental activity of all beings.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་རྒྱུ་དང་། བྱ་བ་དང་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་འཇུག་པར་ཤེས་པ་ལ་བརྗེད་པ་མེད་པར་སྤྱོད་པ་རྣམས་ཡིན་ནོ། །
en: “Noble son, if bodhisattvas possess four qualities, they will act without forgetting the knowledge of how causes, deeds, and actions ripen.

source: ཆད་པར་སྨྲ་བ་མ་ཡིན་པ་དང་། རྟག་པར་སྨྲ་བ་མ་ཡིན་པ་དང་། རྒྱུ་དང་བྱ་བ་དང་ལས་ཀྱི་འབྲས་བུ་ལ་ཡང་དག་པར་ཇི་ལྟ་བ་བཞིན་དུ་འཇུག་པ་དང་། ཆོས་ལ་ཆོས་ཉིད་དུ་བྱེད་ཅིང་ཆོས་ལ་ཆོས་སུ་སྨྲའི་འདི་ལ་བདག་དང་བདག་གིར་མི་སྨྲ་བ་སྟེ།
en: They are (1) not being a proponent of nihilism, (2) not being a proponent of eternalism, (3) correctly knowing the effects of causes, deeds, and actions, and (4) recognizing the true nature of phenomena and describing phenomena as phenomena without imputing any notions of ‘I’ and ‘mine.’

source: དེ་ལྟར་བྱ་བ་ལ་འཇུག་པས་རྒྱུ་དང་བྱ་བ་དང་། ལས་ཀྱི་འབྲས་བུ་མ་རུང་བར་མི་བྱེད་པ་སྟེ།
en: By engaging in activities in that way, bodhisattvas will not disregard the effects of causes, deeds, and actions.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་འདི་བཞི་དང་ལྡན་ན།
en: Noble son, if bodhisattvas possess those four qualities,

source: རྒྱུ་དང་བྱ་བ་དང་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་འཇུག་པ་ཤེས་པ་ལ་བརྗེད་པ་མེད་པར་སྤྱོད་པ་རྣམས་ཡིན་ནོ། །
en: they will act without forgetting the knowledge of how causes, deeds, and actions ripen.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་སྦྱིན་པའི་རྒྱན་གྱིས་བརྒྱན་པ་རྣམས་ཡིན་ནོ། །
en: “Noble son, if bodhisattvas possess four qualities, they will be adorned with the ornament of generosity.

source: མཚན་གྱིས་ལེགས་པར་བརྒྱན་པ་རྣམས་ཡིན།
en: They are (1) being adorned with the major marks,

source: དཔེ་བྱད་བཟང་པོས་རྣམ་པར་སྤྲས་པ་རྣམས་ཡིན།
en: (2) being ornamented by the excellent minor marks,

source: གཟུགས་ལྟ་བས་མི་ངོམས་པ་རྣམས་ཡིན།
en: (3) having an appearance that others never get tired of looking at, and

source: ལག་ན་རིན་པོ་ཆེ་ཐོབ་པས་ལོངས་སྤྱོད་མི་ཟད་པ་སྟེ།
en: (4) receiving jewels in their hands and thereby possessing inexhaustible wealth.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་འདི་བཞི་དང་ལྡན་ན་སྦྱིན་པའི་རྒྱན་གྱིས་བརྒྱན་པ་རྣམས་ཡིན་ནོ། །
en: Noble son, if bodhisattvas possess those four qualities, they will be adorned with the ornament of generosity.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན།
en: “Noble son, if bodhisattvas possess four qualities,

source: ཚུལ་ཁྲིམས་ཀྱི་རྒྱན་གྱིས་བརྒྱན་པ་རྣམས་ཡིན་ནོ། །
en: they will be adorned with the ornament of discipline.

source: འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་འགྱུར་ཞིང་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱིས་བརྒྱན་པ་དང་། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དུ་འགྱུར་ཞིང་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱིས་བརྒྱན་པ་དང་། མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱིས་བརྒྱན་པ་དང་། ངན་འགྲོ་ཐམས་ཅད་ཡང་དག་པར་བཅད་ནས་ལྷ་དང་མིར་སྐྱེ་བ་ཡོངས་སུ་བཟུང་བར་གྱུར་ཅིང་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱིས་བརྒྱན་པ་ཡིན་ཏེ
en: They are (1) becoming universal monarchs and being adorned with the mind set on awakening, (2) becoming Śakra, lord of the gods, and being adorned with the mind set on awakening, (3) becoming Brahmā, lord of the Sahā world, and being adorned with the mind set on awakening, and (4) taking birth as gods or humans after having cut off the entrances to all the lower realms, and being adorned with the mind of awakening.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་འདི་བཞི་དང་ལྡན་ན་ཚུལ་ཁྲིམས་ཀྱི་རྒྱན་གྱིས་བརྒྱན་པ་རྣམས་སུ་རིག་པར་བྱའོ། །
en: Noble son, you should know that if bodhisattvas possess those four qualities they will be adorned with the ornament of discipline.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་བཟོད་པའི་རྒྱན་གྱིས་བརྒྱན་པ་རྣམས་ཡིན་ནོ། །
en: “Noble son, if bodhisattvas possess four qualities, they will be adorned with the ornament of patience.

source: ཚངས་པའི་སྐད་དང་སྒྲ་དབྱངས་ལྟ་བུ་དང་ལྡན་པ་རྣམས་ཡིན།
en: They are (1) having pleasing voices and speech like that of Brahmā,

source: ཀ་ལ་པིང་ཀའི་སྒྲ་དང་། རྔ་སྒྲ་ལྟ་བུ་དང་ལྡན་པ་རྣམས་ཡིན།
en: (2) having voices like the song of kalaviṅka birds, or like music,

source: སྐྱེ་བོ་མང་པོས་མཐོང་ན་སྡུག་ཅིང་ཡིད་དུ་འོང་བ་རྣམས་ཡིན།
en: (3) being pleasing and delightful to many beings when seen, and

source: དགེ་བའི་ཆོས་རྣམས་ལ་ཡི་དམ་ལ་བརྟན་པ་རྣམས་ཡིན་ཏེ།
en: (4) being firmly committed to virtue.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་འདི་བཞི་དང་ལྡན་ན་བཟོད་པའི་རྒྱན་གྱིས་བརྒྱན་པ་རྣམས་སུ་རིག་པར་བྱའོ། །
en: Noble son, you should know that, if bodhisattvas possess those four qualities, they will be adorned with the ornament of patience.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་བརྩོན་འགྲུས་ཀྱི་རྒྱན་གྱིས་བརྒྱན་པར་རིག་པར་བྱའོ། །
en: “Noble son, you should know that, if bodhisattvas possess four qualities, they will be adorned with the ornament of diligence.

source: དམ་བཅས་པ་ཉམས་འོག་ཏུ་ཆུད་པར་བྱ་བའི་ཆོག་ཤེས་པས་དགེ་བའི་ཆོས་རྣམས་ལ་ཡི་དམ་ལ་བརྟན་པ་རྣམས་ཡིན།
en: They are (1) being firmly committed to virtuous qualities through contentment that is grounded in commitment,

source: ཕ་རོལ་གྱིས་མནན་པ་མེད་པས་རྡོ་རྗེའི་ལུས་རབ་ཏུ་ཐོབ་པ་རྣམས་ཡིན།
en: (2) achieving vajra bodies that cannot be subdued by others,

source: བྱ་བ་ཅི་ཡོད་ཅེས་བྱ་བ་ལ་མོས་པས་གསོལ་བ་མ་བཏབ་པར་སེམས་ཅན་ཐམས་ཅད་ལ་དགེ་བའི་བཤེས་གཉེན་བྱེད་པ་རྣམས་ཡིན།
en: (3) acting as virtuous friends for all beings without being asked, out of a desire to help, and

source: ཐོས་པའི་ཚོགས་བསགས་པས་མི་ངོམས་པའི་ཕྱིར་ཡིད་ཡོངས་སུ་མི་སྐྱོ་བ་རྣམས་ཡིན་ཏེ།
en: (4) never becoming weary or sated while accumulating a wealth of learning.

source: བརྩོན་འགྲུས་ཀྱི་རྒྱན་གྱིས་བརྒྱན་པ་རྣམས་སུ་རིག་པར་བྱའོ། །
en: they will be adorned with the ornament of diligence.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་བསམ་གཏན་གྱི་རྒྱན་གྱིས་བརྒྱན་པ་རྣམས་ཡིན་ནོ། །
en: “Noble son, if bodhisattvas possess four qualities, they will be adorned with the ornament of concentration.

source: མི་རྒོད་པ་རྣམས་ཡིན།
en: They are (1) not being agitated,

source: མ་ཁེངས་པ་རྣམས་ཡིན།
en: (2) not being stupefied,

source: མུ་ཅོར་སྨྲ་བ་མེད་པ་རྣམས་ཡིན།
en: (3) not talking nonsense, and

source: ཅང་ཤེས་ཀྱི་སེམས་མི་འདོར་བ་རྣམས་ཡིན་ཏེ།
en: (4) never forsaking the insightful mind.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་འདི་བཞི་དང་ལྡན་ན་བསམ་གཏན་གྱི་རྒྱན་གྱིས་བརྒྱན་པ་རྣམས་ཡིན་ནོ། །
en: Noble son, if bodhisattvas possess those four qualities, they will be adorned with the ornament of concentration.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་འདི་བཞི་དང་ལྡན་ན་ཤེས་རབ་ཀྱི་རྒྱན་གྱིས་བརྒྱན་པ་རྣམས་ཡིན་ནོ། །
en: “Noble son, if bodhisattvas possess four qualities, they will be adorned with the ornament of insight.

source: བདག་དང་སེམས་ཅན་དང་། སྲོག་དང་གསོ་བ་དང་། སྐྱེས་བུ་དང་། གང་ཟག་ཏུ་སྨྲ་བ་མེད་པ་རྣམས་ཡིན།
en: They are (1) not being proponents of a self, a sentient being, a life principle, an individuality, a soul, or a person,

source: སྤོབས་པ་ཆགས་པ་མེད་པ་རྣམས་ཡིན།
en: (2) possessing unobstructed eloquence,

source: ཚིག་ཐམས་ཅད་རབ་ཏུ་དབྱེ་བ་བསྟན་པ་ཤེས་པ་ལ་མཁས་པ་རྣམས་ཡིན།
en: (3) being expert in knowing how to teach the distinctions of all words, and

source: ཆོས་ཐམས་ཅད་ལ་སོམ་ཉི་མེད་ཅིང་ཐེ་ཙོམ་དང་བྲལ་བ་རྣམས་ཡིན་ཏེ།
en: (4) being free from doubts and hesitations with respect to all Dharma teachings.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་ཚངས་པའི་ལམ་ལ་མཁས་པ་རྣམས་ཡིན་ནོ། །
en: “Noble son, if bodhisattvas possess four qualities, they will be experts in the path of purity.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་དཔུང་གཉེན་བྱ་བའི་ཕྱིར་མངོན་པར་བསྒྲུབས་པའི་བྱམས་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་མངོན་པར་བསྒྲུབས་པའི་སྙིང་རྗེ་ཆེན་པོ་དང་། ཆོས་ཐམས་ཅད་ལ་དགའ་བས་མངོན་པར་བསྒྲུབས་པའི་དགའ་བ་དང་། དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀྱི་ཕྱིར་མངོན་པར་བསྒྲུབས་པའི་བཏང་སྙོམས་ཏེ།
en: They are (1) producing love that manifests in order to be a refuge for all sentient beings, (2) producing great compassion that manifests in order to ripen all beings, (3) producing joy that manifests due to being delighted with all phenomena, and (4) producing equanimity that manifests for the sake of the wisdom of the thus-gone ones.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་འདི་བཞི་དང་ལྡན་ན་ཚངས་པའི་ལམ་ལ་མཁས་པ་རྣམས་ཡིན་ནོ། །
en: Noble son, if bodhisattvas possess those four qualities, they will be experts in the path of purity.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་མངོན་པར་ཤེས་པ་ལས་མི་ཉམས་པ་རྣམས་ཡིན་ནོ། །
en: “Noble son, if bodhisattvas possess four qualities, their higher perceptions will remain free of decline.

source: བསམ་གཏན་བཞི་སྡུད་པའི་ཤེས་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་བསྒྲུབས་པའི་ཐབས་ཤེས་པ་དང་། རང་གིས་སེམས་ལ་དབང་སྒྱུར་བའི་ཆོས་ཤེས་པ་དང་། སངས་རྒྱས་ལ་བལྟ་བའི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཞིང་མཐའ་ཡས་པར་འགྲོ་བ་སྟེ།
en: They are (1) possessing the knowledge that subsumes the four concentrations, (2) knowing the way to accomplish the four formless attainments, (3) knowing how to control their minds, and (4) being able to travel to countless buddha realms to behold buddhas.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་འདི་བཞི་དང་ལྡན་ན་མངོན་པར་ཤེས་པ་ལས་མི་ཉམས་པ་རྣམས་ཡིན་ནོ། །
en: Noble son, if bodhisattvas possess those four qualities, their higher perceptions will remain free of decline.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་གཡུལ་ལས་རྣམ་པར་རྒྱལ་བ་རྣམས་ཡིན་ནོ། །
en: “Noble son, if bodhisattvas possess four qualities, they will be victorious in battle.

source: ནང་ཉེ་བར་ཞི་བ་དང་། ཕྱི་རོལ་དུ་མི་རྒྱུ་བ་དང་། ཆོས་ཐམས་ཅད་ལ་སྒྱུ་མ་ལྟ་བུ་རབ་ཏུ་རྟོག་པའི་ཤེས་པ་དང་། ཡེ་ཤེས་ཀྱི་སྟོབས་ཅན་ཡིན་གྱི་ཉོན་མོངས་པའི་སྟོབས་ཅན་མ་ཡིན་པ་སྟེ།
en: They are (1) being peaceful inwardly, (2) not letting their minds wander outwardly, (3) understanding all phenomena to be like illusions, and (4) being endowed with the power of wisdom, not the power of afflictions.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་འདི་བཞི་དང་ལྡན་ན་གཡུལ་ལས་རྣམ་པར་རྒྱལ་བ་རྣམས་ཡིན་ནོ། །
en: Noble son, if bodhisattvas possess those four qualities, they will be victorious in battles.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་རྒལ་ནས་ཕ་རོལ་ཐང་ལ་གནས་པ་རྣམས་ཡིན་ནོ། །
en: “Noble son, if bodhisattvas possess four qualities, they will remain on the far shore after having crossed over.

source: འདོད་པའི་ཆུ་བོ་ཡང་རབ་ཏུ་ཤེས་ལ་འདོད་ཆགས་དང་བྲལ་བ་ཡང་མངོན་སུམ་དུ་མི་བྱེད་པ་དང་། སྲིད་པའི་ཆུ་བོ་ཡང་རབ་ཏུ་ཤེས་ལ་བསམས་བཞིན་དུ་ཡང་སྐྱེ་བ་དང་། ལྟ་བའི་ཆུ་བོ་ཡང་རབ་ཏུ་ཤེས་ལ་ལྟ་བའི་བཅིང་བས་བཅིངས་པ་ཡང་མི་འདོར་བ་དང་། མ་རིག་པའི་ཆུ་བོ་ཡང་རབ་ཏུ་ཤེས་ལ་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་རྗེས་སུ་འཐུན་པར་ཡང་བྱེད་པ་སྟེ།
en: They are (1) understanding the river of desire but not manifesting the freedom from attachment, (2) understanding the river of existence but taking birth intentionally, (3) understanding the river of views but not forsaking those who are bound by the fetters of views, and (4) understanding the river of ignorance but acting in harmony with dependent origination.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་འདི་བཞི་དང་ལྡན་ན་རྒལ་ནས་ཕ་རོལ་ཐང་ལ་གནས་པ་རྣམས་ཡིན་ནོ། །
en: Noble son, if bodhisattvas possess those four qualities, they will remain on the far shore after having crossed over.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་
en: “Noble son, if bodhisattvas possess four qualities,

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་ལམ་ཡང་སྟོན་ལ་མཚུངས་པར་སྤྱོད་པ་ཡང་རྣམ་པར་མི་རྟོག་པ་རྣམས་ཡིན་ནོ། །
en: they will display and imitate the conduct of hearers, solitary buddhas, and all beings while remaining without concepts.

source: སྒྱུ་མ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ཤིན་ཏུ་ཡོངས་སུ་བསྒྲུབས་པ་དང་། ཆོས་ཐམས་ཅད་རྣམ་པར་བསྒྲུབས་པས་སོ་སོར་ཉེ་བར་གནས་པའི་མཚན་ཉིད་དུ་ཤིན་ཏུ་བརྟགས་པ་དང་། མངོན་པར་ཤེས་པ་ལྔས་རྣམ་པར་རྩེ་བ་ཤེས་པ་དང་ལྡན་པ་དང་། ཡིད་ཀྱི་ལུས་མངོན་པར་བསྒྲུབས་པ་ལ་མཁས་པ་སྟེ།
en: They are (1) having accomplished the illusory absorption, (2) having ascertained that all phenomena are characterized by involvement in fabrication, (3) knowing how to sport by means of the five higher perceptions, and (4) being skilled in manifesting mental bodies.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་འདི་བཞི་དང་ལྡན་ན་
en: Noble son, if bodhisattvas possess those four qualities,

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་ལམ་ཡང་སྟོན་ལ་མཚུངས་པར་སྤྱོད་པར་ཡང་རྣམ་པར་མི་རྟོག་པ་རྣམས་ཡིན་ནོ། །
en: they will display and imitate the conduct of hearers, solitary buddhas, and all beings while remaining without concepts.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་འཁོར་བ་ལ་ཡང་ལྟ་ལ་མྱ་ངན་ལས་འདས་པ་ལ་ཡང་མི་གནས་པ་རྣམས་ཡིན་ནོ། །
en: “Noble son, if bodhisattvas possess four qualities, they will set their sights on saṃsāra without remaining in nirvāṇa.

source: སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་དང་། སྙིང་རྗེ་ཆེན་པོའི་སེམས་དང་། ཐབས་ལ་མཁས་པ་དང་། སྔོན་གྱི་ཡི་དམ་མི་འདོར་བ་སྟེ།
en: They are (1) being endowed with the blessings of the buddhas, (2) the attitude of great compassion, (3) skill in means, and (4) not forsaking past promises.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་འཁོར་བ་ལ་ཡང་ལྟ་ལ་མྱ་ངན་ལས་འདས་པ་ཡང་མི་གནས་པ་རྣམས་ཡིན་ནོ། །
en: Noble son, if bodhisattvas possess those four qualities, they will set their sights on saṃsāra without remaining in nirvāṇa.
